"""
Самостоятельная 2
Выполнил: Петров Роман
ИВТ 2 курс группа 1.1
Вариант № 7
"""

"""
Задание 1.1
Вывести таблицу истинности для штриха Шеффера
"""
print("\nЗадание 1.1\n")
def Shefer(a,b):
    res = not(a&b)
    if res == True:
        res = 1
    if res == False:
        res = 0
    return res
def output(A,B):
    print("|  {}  |  {}  |   {}   |".format(A, B, Shefer(A, B)))
    print("---------------------")

print("---------------------")
print("|  a  |  b  |  a|b  |")
print("---------------------")

output(0,0)
output(0,1)
output(1,0)
output(1,1)
"""
Задание 1.5
Вывести таблицу истинности для: (A∨B)∧ ¬C
"""
print("\n\nЗадание 1.5\n")

def K(A,B,C):
    res = ((A | B) & (not (C)))
    return res

def output2(A,B,C):
    print("|  {}  |  {}  |  {}  |       {}      |".format(A,B,C, K(A,B,C)))
    print("----------------------------------")

print("----------------------------------")
print("|  a  |  b  |  c  |  (A∨B) ∧ ¬C  |")
print("----------------------------------")

output2(0,0,0)
output2(1,0,0)
output2(0,1,0)
output2(0,0,1)
output2(1,1,0)
output2(1,0,1)
output2(0,1,1)
output2(1,1,1)



"""
Задание 1.14
Вывести таблицу истинности для: A∧C→B ∨ ¬(C∧A)
"""
print("\n\nЗадание 1.14\n")

def Z(A,B,C):
    res = A & (not C) | B | (not(C & A))
    return res

def output3(A,B,C):
    print("|  {}  |  {}  |  {}  |        {}       |".format(A,B,C, Z(A,B,C)))
    print("------------------------------------")

print("------------------------------------")
print("|  a  |  b  |  c  |  A∧C→B∨¬(C∧A)  |")
print("------------------------------------")


output3(0,0,0)
output3(1,0,0)
output3(0,1,0)
output3(0,0,1)
output3(1,1,0)
output3(1,0,1)
output3(0,1,1)
output3(1,1,1)


"""
Задание 3.7
Дан список:[ 0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610, 987, 1597, 2584, 4181, 6765, 10946]
Вывести список элементов, стоящих на четных позициях во второй половине списка в обратном порядке.
"""
print("\n\nЗадание 3.7\n")

list_1 = [0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610, 987, 1597, 2584, 4181, 6765, 10946]

q = int(len(list_1) / 2)
print("Новый список = ",list_1[:q-1:-2])

"""
Задание 3.21
 Дан кортэж : 
 car = ("name", " DeLorean DMC-12", "motor_pos": "rear", "n_of_wheels", 4, "n_of_passengers", 2, "weight", 1.230, "height", 1.140, "length", 4.216, "width", 1.857, "max_speed", 177)
 Найти сумму всех целочисленных элементов кортэжа 
"""
print("\n\nЗадание 3.21\n")

#Был удалён элемент кортэжа "motor_pos": "rear", тк он выдавал ошибку (является ключём) 
car = ("name", " DeLorean DMC-12",  "n_of_wheels", 4, "n_of_passengers", 2, "weight", 1.230, "height", 1.140, "length", 4.216, "width", 1.857, "max_speed", 177)

s = []

s.append(car[3])
s.append(car[5])
s.append(car[-1])

print("Сумма целочисленных чисел =",sum(s))
